## Python Pandas and Basic Scikit learn Tutorials for Data Analysis and Machine Learning. by - Rahul Kulkarni

I recommend using Python3 and Anaconda distribution of Python.

I have used dataset from Titanic competition Kaggle.
https://www.kaggle.com/c/titanic

In [273]:
#Load libraries

import os
os.chdir("C:/Users/Rahul/Desktop/Pandas Tutorials")
import pandas as pd

In [274]:
data = pd.read_csv("train.csv")
data.head(5)
data.sample(5) # Sample few columns
data.sample(frac=0.002) # use scikit train test split function

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
197,198,0,3,"Olsen, Mr. Karl Siegwart Andreas",male,42.00,0,1,4579,8.4042,NaN,S

In [275]:
# To select a particulat column in pandas
data.Sex
# or you can use
data['Sex'].head(5)
data.Sex.unique()
data.Pclass.value_counts()
pd.crosstab(data.Sex,data.Pclass)

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [276]:
# Now we shall create a new column with the existing columns
data['NewName'] = data['Sex'] + " : " + data['Name']
data.head(3)
data.duplicated().sum()
#data.Name.duplicated():
data.Name.drop_duplicates().head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [277]:
# Now we will see the summary statistics ... People coming from R, its similar to summary()
data.describe()
data.info()
#data.describe(include = ['float']) - for variables with floating numbers
#data.describe(include = ['object']) - for class variables
#data.memory_usage(deep=True)
#data.Sex.astype('category') # this will decrese the size of DF, dont break your head here

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
NewName        891 non-null object
dtypes: float64(2), int64(5), object(6)
memory usage: 90.6+ KB

C:\Users\Rahul\Anaconda3\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

In [278]:
# For number of Rows and Columns  --- in R its dim()
data.shape # this is not a function call, so you dont need parantesis

(891, 13)

In [279]:
# To see the data types of the variables in the data --  in R its str()
data.dtypes
# Changing data types in Pandas
data.dtypes
#data.Age.astype(int)
# Here you will get "ValueError: Cannot convert NA to integer"..know error in pandas ... for better performance use float

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
NewName         object
dtype: object

In [280]:
# Rename a columns
data.columns
data.rename(columns={'Sex' : 'Gender'},inplace=True)

In [281]:
# Drop a column in pandas
data.drop('NewName',axis=1,inplace=True) 
# inplace=true will dirctly change the dataframe object, unline in R you dont have to create a new object which occupies space 
data.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [282]:
# Sort a pandas series object
data.Age.sort_values(ascending=False).head()
# Sort datafram using a series object
data.sort_values('Age').head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

In [283]:
data.Age > 40 # will output boolien values in R data$Age > 40
data[data.Age > 40].head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S

In [284]:
# Now lets apply multiple conditions to filter data use 'and/(&)' and 'or/(|)'
data[(data.Age > 40) & (data.Gender == 'male')].head()
data.Gender.map({'male':1,'female':0}).head(4)
data[data.Age.notnull()].head()
# Make sure both the filter conditions atre in brackets , I know this is little confusing in the begining

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [285]:
# filtering based on some clas Using 'isin'
data.Cabin.unique()
data[data.Cabin.isin(['D47','B30','C83'])]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
136,137,1,1,"Newsom, Miss. Helen Monypeny",female,19.0,0,2,11752,26.2833,D47,S
230,231,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.0,1,0,36973,83.4750,C83,S

In [288]:
data.Name.str.split().head()

0                         [Braund,, Mr., Owen, Harris]
1    [Cumings,, Mrs., John, Bradley, (Florence, Bri...
2                           [Heikkinen,, Miss., Laina]
3    [Futrelle,, Mrs., Jacques, Heath, (Lily, May, ...
4                        [Allen,, Mr., William, Henry]
Name: Name, dtype: object

In [289]:
def get_element(my_list, position):
    return my_list[position]

In [300]:
data['FirstName'] = data.Name.str.split().apply(get_element, position=0)
data['Title'] = data.Name.str.split().apply(get_element,position=1)
data['LastName'] = data.Name.str.split().apply(get_element,position=2)
data.head(5)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FirstName,Title,LastName
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"Braund,",Mr.,Owen
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"Cumings,",Mrs.,John
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"Heikkinen,",Miss.,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,"Futrelle,",Mrs.,Jacques
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,"Allen,",Mr.,William

In [261]:
# To see the number of missing values in each column
data.isnull().sum()
data.shape
data.dropna().shape # drops all the rows having NA's
data.fillna(0).shape # fill NA's with 0
# Drop duplicate columns if exists
data.drop_duplicates().shape
# Apply filter on NA's
data[data.Age.isnull()].head(2)
data.Age.fillna(data.Age.mean(),inplace=True)
data.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [262]:
data.mean(axis=0) # Find the mean of all the columns
data.min(0) # Find the minimum value of all the columns
data.max(0) # Find the max value of all the columns

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Age             80.0000
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [263]:
data.Gender.str.upper()
data.Gender.isin(["male"]).head()

0     True
1    False
2    False
3    False
4     True
Name: Gender, dtype: bool

In [264]:
#change data types in pandas
data.PassengerId.astype(float,inplace=True)
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Gender          object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [265]:
orders = pd.read_table('http://bit.ly/chiporders')
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [266]:
orders.item_price.str.replace('$','').astype(float).head()

0     2.39
1     3.39
2     3.39
3     2.39
4    16.98
Name: item_price, dtype: float64

In [267]:
# Group by in pandas
data.Gender.value_counts()
data.groupby('Gender').Survived.sum()
data.groupby('Pclass').Survived.sum()
data.groupby('Gender').Survived.agg(['count','mean','min','max'])

        count      mean  min  max
Gender
female    314  0.742038    0    1
male      577  0.188908    0    1

In [268]:
# every DataFrame has an index (sometimes called the "row labels")
data.index
data1 = data.set_index('PassengerId')
data1.index.name = None # Index name can be none
data1.head()

,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Selecting multiple rows and columns in a Data Frame
- loc method is used to select rows and columns by label.
- iloc method is used to select rows and columns by integer position

In [269]:
# read a dataset of UFO reports into a DataFrame
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [270]:
ufo.loc[:,'City']
ufo.loc[:,['Colors Reported','City']]
ufo.loc[23,['Colors Reported','City']]
ufo.loc[23:29,['Colors Reported','City']]
ufo.loc[[23,27,30],['Colors Reported','City']]
ufo.loc[ufo.City == 'Clovis', 'State' ] # Displays states having Clovis city

27       NM
1589     CA
2879     NM
2905     NM
4703     CA
4971     NM
6903     CA
7287     CA
7431     CA
8033     CA
15613    CA
16504    CA
Name: State, dtype: object

In [205]:
ufo.iloc[12,:]
ufo.iloc[:,0]
ufo.iloc[2:7,0:3]

                   City Colors Reported Shape Reported
2               Holyoke             NaN           OVAL
3               Abilene             NaN           DISK
4  New York Worlds Fair             NaN          LIGHT
5           Valley City             NaN           DISK
6           Crater Lake             NaN         CIRCLE